:PROPERTIES:
:ID:       9adf4202-9e48-4f16-915c-fc8fb4949ca1
:END:
#+title: From Javascript to Python
#+Property: header-args :exports both
#+filetags: :article:teaching:

This will cover some of Python, for another good introduction to the language refer to [[https://www.codecademy.com/learn]].


Similarly to Javascript Python in an interpreted language. It has a less "verbose" syntax than JS hovwever,
and some particular advantages.

Let's look at some fundamental differences:

** Tuples
The ~tuple~ object in Python is an iterable object very similar to a ~list~, with the main difference that it is *immutable*. We create it with opening and closing round brackets. E.g.
#+BEGIN_SRC jupyter-python :session py
vals = (10, 20, 30)
#+END_SRC

#+RESULTS:

However, while for the case of a list we could assign an element, for tuples this is not possible. E.g
#+BEGIN_SRC jupyter-python :session py
vals[0] = 1
#+END_SRC

#+RESULTS:
:RESULTS:
# [goto error]
: ---------------------------------------------------------------------------
: TypeError                                 Traceback (most recent call last)
: /var/folders/sr/zs7syfx13zzfn32_m3hpw17c0000gn/T/ipykernel_11804/311428616.py in <cell line: 1>()
: ----> 1 vals[0] = 1
:
: TypeError: 'tuple' object does not support item assignment
:END:
will give us an error.

* Packages and modules
Apart from being a powerful languages, one of the most attractive features of
Python is the availability of a immense variety of "packages", extensions that
allow to achieve all kinds of functionality. A package is a collection of
/modules/ that are organized in a directory structure and can be imported into
other programs to use their functionality. A module is a single file that
contains definitions and statements, and can include functions, classes, and
variables.

As an example, you can create a file called ~my_functions.py~ and place it in
the same directory as your main Python file or notebook. You can then ~import~
the module with ~import my_functions~ and use the functions contained in the
~my_functions.py~ file with the "dot notation", for example ~my_functions.add(3,
2)~. Python also has a number of built-in modules. For example to access a
number of mathematical operations one can use the ~math~ module:
#+BEGIN_SRC jupyter-python :session py
import math
math.sqrt(2)
#+END_SRC

#+RESULTS:
: 1.4142135623730951

Packages allow you to further structure code by grouping related modules
together. For example, later on we will use the ~matplotlib~ package and import
a specific submodule with
#+BEGIN_SRC jupyter-python :session py
from matplotlib import pyplot
#+END_SRC
An alternative notation is the following:
#+BEGIN_SRC jupyter-python :session py
import matplotlib.pyplot as plt
#+END_SRC
and here we explicitly thell Python how we want to refer to the module. This is
often used to abbreviate the name of the module in order to reduce typing.
Another example of this syntax that we will use is:
#+BEGIN_SRC jupyter-python :session py
import numpy as np
#+END_SRC
Here numpy as a package that immediately provides a set of functionalities
without requiring to specify the specific submodule.
